app/controllers/shares_controller.rb

  def index
    @shares = Share.all
---
SELECT "shares".* FROM "shares"

  def destroy
    File.delete('shares/' + @share.filename)
---
DELETE FROM "shares" WHERE "shares"."id" = ?  [["id", 226]]

    def set_share_with_id
      @share = Share.find(params[:id])
---
SELECT  "shares".* FROM "shares"  WHERE "shares"."id" = ? LIMIT 1  [["id", 226]]

    def set_share_with_token
      @share = Share.find_by(token: params[:token])
---
SELECT  "shares".* FROM "shares"  WHERE "shares"."token" = 'path' LIMIT 1